# N명의 병사가 무작위로 나열되어 있다. 각 병사는 특정한 값의 전투력을 보유하고 있다
# 병사를 배치할 때는 전투력이 높은 병사가 앞쪽에 오도록 내림차순으로 배치를 하고자 한다.
# 다시 말해 앞쪽에 있는 병사의 전투력이 항상 뒤쪽에 있는 병사보다 높아야 한다
# 또한 배치 과정에서는 특정한 위치에 있는 병사를 열외시키는 방법을 이용한다.
# 그러면서도 남아 있는 병사의 수가 최대가 되도록 하고 싶다
# 예를 들어, N = 7일 때 나열된 병사들의 전투력이 다음과 같다고 가정한다
# 15 11 4 8 5 2 4 일때 , 3번 6번 병사를 열외시키면 남아있는 병사가 내림차순 형태로 5명이 된다
# 병사에 대한 정보가 주어졌을 때, 남아 있는 병사의 수가 최대가 되도록 하기 위해서 열외시켜야 하는 병사의 수를 출력하는 프로그램을 작성하라

# 이 문제의 기본 아이디어는 가장 긴 증가하는 부분 수열(Longest Increasing Subsequence, LIS)로 알려진 전형적인 다이나믹 프로그래밍 문제의 아이디어와 같다
# D를 다 1로 초기화 해두고, 모든 0<=j<i 에 대하여 D[i] = max(D[i], D[j]+1) if arr[j]<arr[i]

n = int(input())
array = list(map(int, input().split()))
# 순서를 뒤집어 '최장 증가 부분 수열' 문제로 변환
array.reverse()

# 다이나믹 프로그래밍을 위한 1차원 DP 테이블 초기화
dp = [1] * n

# 가장 긴 증가하는 부분 수열(LIS) 알고리즘 수행
for i in range(1, n):
    for j in range(0, i):
        if array[j] < array[i]:
            dp[i] = max(dp[i], dp[j] + 1)

# 열외해야 하는 병사의 최소 수를 출력
print(n - max(dp))
